[NoCoverage] StringLiteral
src/Categories/CateforiesList/CategoriesList.stories.tsx:5:10
 import CategoriesList, { type ICategoriesListProps } from './CategoriesList'
 
 export default {
-  title: 'UI/CategoriesList',
+  title: "",
   component: CategoriesList
 }

[NoCoverage] BlockStatement
src/Categories/CateforiesList/CategoriesList.stories.tsx:9:49
   component: CategoriesList
 }
 
-export const WithoutValues = (): JSX.Element => {
-  const categoriesWithPrice: ICategoriesListProps = {
-    category: '',
-    costs: NaN
-  }
-  return <CategoriesList {...categoriesWithPrice} />
-}
+export const WithoutValues = (): JSX.Element => {}
 
 export const Default = (): JSX.Element => {

[NoCoverage] ObjectLiteral
src/Categories/CateforiesList/CategoriesList.stories.tsx:10:53
 }
 
 export const WithoutValues = (): JSX.Element => {
-  const categoriesWithPrice: ICategoriesListProps = {
-    category: '',
-    costs: NaN
-  }
+  const categoriesWithPrice: ICategoriesListProps = {}
   return <CategoriesList {...categoriesWithPrice} />
 }

[NoCoverage] BlockStatement
src/Categories/CateforiesList/CategoriesList.stories.tsx:17:43
   return <CategoriesList {...categoriesWithPrice} />
 }
 
-export const Default = (): JSX.Element => {
-  const categoriesWithPrice: ICategoriesListProps = {
-    category: '1',
-    costs: 1000
-  }
-
-  return <CategoriesList {...categoriesWithPrice}/>
-}
+export const Default = (): JSX.Element => {}
 

[NoCoverage] ObjectLiteral
src/Categories/CateforiesList/CategoriesList.stories.tsx:18:53
 }
 
 export const Default = (): JSX.Element => {
-  const categoriesWithPrice: ICategoriesListProps = {
-    category: '1',
-    costs: 1000
-  }
+  const categoriesWithPrice: ICategoriesListProps = {}
 
   return <CategoriesList {...categoriesWithPrice}/>

[NoCoverage] StringLiteral
src/Categories/CateforiesList/CategoriesList.stories.tsx:19:15
 
 export const Default = (): JSX.Element => {
   const categoriesWithPrice: ICategoriesListProps = {
-    category: '1',
+    category: "",
     costs: 1000
   }
