[Killed] ArrowFunction
src/Infrastructure/TokenProvider/TokenProvider.tsx:18:32
 
 const TokenContext = createContext<TokenContextType>(null)
 
-export const useTokenContext = (): TokenContextType => useContext(TokenContext)
+export const useTokenContext = () => undefined
 
 export const TokenProvider: FC<TokenProviderProps> = ({ children }) => {
killedBy: Header Test Header buttons is in the document if token is exist
statusReason: TestingLibraryElementError: Unable to find an element with the text: Выйти. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/Infrastructure/TokenProvider/TokenProvider.tsx:20:72
 
 export const useTokenContext = (): TokenContextType => useContext(TokenContext)
 
-export const TokenProvider: FC<TokenProviderProps> = ({ children }) => {
-  const [token, setToken] = useState<string | null>(() => localStorage.getItem('token'))
-
-  useEffect(() => {
-    if (token !== null) {
-      localStorage.setItem('token', token)
-    } else {
-      localStorage.removeItem('token')
-    }
-  }, [token])
-
-  const callbacks = useMemo(
-    () => ({
-      login: () => {
-        setToken(Math.random().toString(16))
-      },
-      logout: () => {
-        setToken(null)
-      }
-    }),
-    []
-  )
-
-  return <TokenContext.Provider value={[token, callbacks]}>{children}</TokenContext.Provider>
-}
+export const TokenProvider: FC<TokenProviderProps> = ({ children }) => {}
 
killedBy: Header Test Header buttons is in the document if token is exist
statusReason: TestingLibraryElementError: Unable to find an element with the text: Выйти. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
src/Infrastructure/TokenProvider/TokenProvider.tsx:21:53
 export const useTokenContext = (): TokenContextType => useContext(TokenContext)
 
 export const TokenProvider: FC<TokenProviderProps> = ({ children }) => {
-  const [token, setToken] = useState<string | null>(() => localStorage.getItem('token'))
+  const [token, setToken] = useState<string | null>(() => undefined)
 
   useEffect(() => {
killedBy: Header Test Header buttons is in the document if token is exist
statusReason: TestingLibraryElementError: Unable to find an element with the text: Выйти. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] BlockStatement
src/Infrastructure/TokenProvider/TokenProvider.tsx:23:19
 export const TokenProvider: FC<TokenProviderProps> = ({ children }) => {
   const [token, setToken] = useState<string | null>(() => localStorage.getItem('token'))
 
-  useEffect(() => {
-    if (token !== null) {
-      localStorage.setItem('token', token)
-    } else {
-      localStorage.removeItem('token')
-    }
-  }, [token])
+  useEffect(() => {}, [token])
 
   const callbacks = useMemo(

[Survived] ConditionalExpression
src/Infrastructure/TokenProvider/TokenProvider.tsx:24:9
   const [token, setToken] = useState<string | null>(() => localStorage.getItem('token'))
 
   useEffect(() => {
-    if (token !== null) {
+    if (true) {
       localStorage.setItem('token', token)
     } else {

[Survived] EqualityOperator
src/Infrastructure/TokenProvider/TokenProvider.tsx:24:9
   const [token, setToken] = useState<string | null>(() => localStorage.getItem('token'))
 
   useEffect(() => {
-    if (token !== null) {
+    if (token === null) {
       localStorage.setItem('token', token)
     } else {

[Survived] BlockStatement
src/Infrastructure/TokenProvider/TokenProvider.tsx:26:12
   useEffect(() => {
     if (token !== null) {
       localStorage.setItem('token', token)
-    } else {
-      localStorage.removeItem('token')
-    }
+    } else {}
   }, [token])
 

[Killed] ArrowFunction
src/Infrastructure/TokenProvider/TokenProvider.tsx:32:5
   }, [token])
 
   const callbacks = useMemo(
-    () => ({
-      login: () => {
-        setToken(Math.random().toString(16))
-      },
-      logout: () => {
-        setToken(null)
-      }
-    }),
+    () => undefined,
     []
   )
killedBy: Header Test Header buttons is in the document if token is exist
statusReason: TypeError: Cannot read properties of undefined (reading 'logout')

[Survived] ObjectLiteral
src/Infrastructure/TokenProvider/TokenProvider.tsx:32:12
   }, [token])
 
   const callbacks = useMemo(
-    () => ({
-      login: () => {
-        setToken(Math.random().toString(16))
-      },
-      logout: () => {
-        setToken(null)
-      }
-    }),
+    () => ({}),
     []
   )

[NoCoverage] BlockStatement
src/Infrastructure/TokenProvider/TokenProvider.tsx:33:20
 
   const callbacks = useMemo(
     () => ({
-      login: () => {
-        setToken(Math.random().toString(16))
-      },
+      login: () => {},
       logout: () => {
         setToken(null)

[NoCoverage] BlockStatement
src/Infrastructure/TokenProvider/TokenProvider.tsx:36:21
       login: () => {
         setToken(Math.random().toString(16))
       },
-      logout: () => {
-        setToken(null)
-      }
+      logout: () => {}
     }),
     []
