[NoCoverage] BlockStatement
src/CostList/CostItem/CostItem.stories.tsx:9:43
   component: CostItem
 }
 
-export const Default = (): JSX.Element => {
-  const costItemExample = {
-    name: 'storybook',
-    cost: 10000,
-    category: 'Category',
-    store: 'Store'
-  }
-
-  const onDeleted: () => void = () => {}
-  const key: number = 1
-
-  return <CostItem item={costItemExample} key = { key } onDeleted = {onDeleted} />
-}
+export const Default = (): JSX.Element => {}
 
 export const WithoutValues = (): JSX.Element => {

[NoCoverage] BlockStatement
src/CostList/CostItem/CostItem.stories.tsx:23:49
   return <CostItem item={costItemExample} key = { key } onDeleted = {onDeleted} />
 }
 
-export const WithoutValues = (): JSX.Element => {
-  const costItemExample = {
-    name: '',
-    cost: 0,
-    category: '',
-    store: ''
-  }
-
-  const onDeleted: () => void = () => {}
-  const key: number = 1
-
-  return <CostItem item={costItemExample} key = { key } onDeleted = {onDeleted} />
-}
+export const WithoutValues = (): JSX.Element => {}
 

[NoCoverage] ObjectLiteral
src/CostList/CostItem/CostItem.stories.tsx:24:27
 }
 
 export const WithoutValues = (): JSX.Element => {
-  const costItemExample = {
-    name: '',
-    cost: 0,
-    category: '',
-    store: ''
-  }
+  const costItemExample = {}
 
   const onDeleted: () => void = () => {}

[NoCoverage] StringLiteral
src/CostList/CostItem/CostItem.stories.tsx:28:12
     name: '',
     cost: 0,
     category: '',
-    store: ''
+    store: "Stryker was here!"
   }
 
