[NoCoverage] BlockStatement
src/Navigation/Auth/Auth.tsx:29:31
 const Auth = (): JSX.Element => {
   const location = useLocation()
   const navigate = useNavigate()
-  const onClick = (): void => {
-    const state = location.state as NavigationState
-    login()
-    navigate(state?.from ?? '/')
-  }
+  const onClick = (): void => {}
 
   const tokenContext = useTokenContext()

[NoCoverage] LogicalOperator
src/Navigation/Auth/Auth.tsx:32:14
   const onClick = (): void => {
     const state = location.state as NavigationState
     login()
-    navigate(state?.from ?? '/')
+    navigate(state?.from && '/')
   }
 

[NoCoverage] OptionalChaining
src/Navigation/Auth/Auth.tsx:32:14
   const onClick = (): void => {
     const state = location.state as NavigationState
     login()
-    navigate(state?.from ?? '/')
+    navigate(state.from ?? '/')
   }
 

[Survived] StringLiteral
src/Navigation/Auth/Auth.tsx:39:12
   const login = tokenContext?.[1].login as () => void
 
   const [control, changeControl] = useState<IInputWithValidation>({
-    value: '',
+    value: "Stryker was here!",
     type: 'email',
     label: 'Email',

[Survived] StringLiteral
src/Navigation/Auth/Auth.tsx:42:19
     value: '',
     type: 'email',
     label: 'Email',
-    errorMessage: 'Введите корректный email',
+    errorMessage: "",
     valid: false,
     touched: false,

[Killed] BooleanLiteral
src/Navigation/Auth/Auth.tsx:43:12
     type: 'email',
     label: 'Email',
     errorMessage: 'Введите корректный email',
-    valid: false,
+    valid: true,
     touched: false,
     validation: {
killedBy: Auth Test Auth component render - login button is disabled
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button class="Button success" />

[Survived] ObjectLiteral
src/Navigation/Auth/Auth.tsx:45:17
     errorMessage: 'Введите корректный email',
     valid: false,
     touched: false,
-    validation: {
-      required: true,
-      email: true
-    }
+    validation: {}
   })
 

[Survived] BooleanLiteral
src/Navigation/Auth/Auth.tsx:46:17
     valid: false,
     touched: false,
     validation: {
-      required: true,
+      required: false,
       email: true
     }

[Survived] BooleanLiteral
src/Navigation/Auth/Auth.tsx:47:14
     touched: false,
     validation: {
       required: true,
-      email: true
+      email: false
     }
   })

[Survived] BlockStatement
src/Navigation/Auth/Auth.tsx:51:81
     }
   })
 
-  const onChangeHandler = (event: React.ChangeEvent<HTMLInputElement>): void => {
-    const newControl = { ...control }
-    newControl.value = event.target.value
-    newControl.touched = true
-    newControl.valid = validateControl(control.value, control.validation)
-    changeControl(newControl)
-  }
+  const onChangeHandler = (event: React.ChangeEvent<HTMLInputElement>): void => {}
 
   const validateControl = (value: string, validation: IValidation): boolean => {

[Survived] BooleanLiteral
src/Navigation/Auth/Auth.tsx:54:26
   const onChangeHandler = (event: React.ChangeEvent<HTMLInputElement>): void => {
     const newControl = { ...control }
     newControl.value = event.target.value
-    newControl.touched = true
+    newControl.touched = false
     newControl.valid = validateControl(control.value, control.validation)
     changeControl(newControl)

[Survived] BlockStatement
src/Navigation/Auth/Auth.tsx:59:80
     changeControl(newControl)
   }
 
-  const validateControl = (value: string, validation: IValidation): boolean => {
-    let isValid = true
-    if (validation.required) {
-      isValid = value.trim() !== '' && isValid
-    }
-    if (validation.email) {
-      isValid = is.email(value)
-    }
-    return isValid
-  }
+  const validateControl = (value: string, validation: IValidation): boolean => {}
 
   return (

[Survived] BooleanLiteral
src/Navigation/Auth/Auth.tsx:60:19
   }
 
   const validateControl = (value: string, validation: IValidation): boolean => {
-    let isValid = true
+    let isValid = false
     if (validation.required) {
       isValid = value.trim() !== '' && isValid

[Survived] ConditionalExpression
src/Navigation/Auth/Auth.tsx:61:9
 
   const validateControl = (value: string, validation: IValidation): boolean => {
     let isValid = true
-    if (validation.required) {
+    if (true) {
       isValid = value.trim() !== '' && isValid
     }

[Survived] ConditionalExpression
src/Navigation/Auth/Auth.tsx:61:9
 
   const validateControl = (value: string, validation: IValidation): boolean => {
     let isValid = true
-    if (validation.required) {
+    if (false) {
       isValid = value.trim() !== '' && isValid
     }

[Survived] LogicalOperator
src/Navigation/Auth/Auth.tsx:62:17
   const validateControl = (value: string, validation: IValidation): boolean => {
     let isValid = true
     if (validation.required) {
-      isValid = value.trim() !== '' && isValid
+      isValid = value.trim() !== '' || isValid
     }
     if (validation.email) {

[Survived] MethodExpression
src/Navigation/Auth/Auth.tsx:62:17
   const validateControl = (value: string, validation: IValidation): boolean => {
     let isValid = true
     if (validation.required) {
-      isValid = value.trim() !== '' && isValid
+      isValid = value !== '' && isValid
     }
     if (validation.email) {

[Survived] ConditionalExpression
src/Navigation/Auth/Auth.tsx:64:9
     if (validation.required) {
       isValid = value.trim() !== '' && isValid
     }
-    if (validation.email) {
+    if (true) {
       isValid = is.email(value)
     }

[Survived] BlockStatement
src/Navigation/Auth/Auth.tsx:64:27
     if (validation.required) {
       isValid = value.trim() !== '' && isValid
     }
-    if (validation.email) {
-      isValid = is.email(value)
-    }
+    if (validation.email) {}
     return isValid
   }

[Survived] BooleanLiteral
src/Navigation/Auth/Auth.tsx:76:27
         <div>Авторизация</div>
         <Input
           valid={control.valid}
-          shouldValidate={true}
+          shouldValidate={false}
           touched={control.touched}
           errorMessage={control.errorMessage}

[Killed] BooleanLiteral
src/Navigation/Auth/Auth.tsx:84:21
           label={control.label}
           onChange={onChangeHandler} />
         <Button
-          disabled={!control.valid}
+          disabled={control.valid}
           type='success'
           onClick={onClick}
killedBy: Auth Test Auth component render - login button is disabled
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button class="Button success" />
