[NoCoverage] BlockStatement
src/CostList/CostItemAdd/CostItemAdd.stories.tsx:9:43
   component: CostItemAdd
 }
 
-export const Default = (): JSX.Element => {
-  const onAddMock = (): void => {
-  }
-
-  return <CostItemAdd onAdd={onAddMock} categories={['1', '2']}/>
-}
+export const Default = (): JSX.Element => {}
 
 export const WithoutValues = (): JSX.Element => {

[NoCoverage] StringLiteral
src/CostList/CostItemAdd/CostItemAdd.stories.tsx:13:54
   const onAddMock = (): void => {
   }
 
-  return <CostItemAdd onAdd={onAddMock} categories={['1', '2']}/>
+  return <CostItemAdd onAdd={onAddMock} categories={["", '2']}/>
 }
 

[NoCoverage] BlockStatement
src/CostList/CostItemAdd/CostItemAdd.stories.tsx:16:49
   return <CostItemAdd onAdd={onAddMock} categories={['1', '2']}/>
 }
 
-export const WithoutValues = (): JSX.Element => {
-  const onAddMock = (): void => {
-  }
-
-  return <CostItemAdd onAdd={onAddMock} categories={['1', '2']}/>
-}
+export const WithoutValues = (): JSX.Element => {}
 
