[Survived] StringLiteral
src/CostList/CostItemAdd/CostItemAdd.tsx:45:23
         value: '',
         type: 'text',
         label: 'Наименование',
-        errorMessage: 'Введите корректное имя',
+        errorMessage: "",
         valid: false,
         touched: false,

[Survived] BooleanLiteral
src/CostList/CostItemAdd/CostItemAdd.tsx:46:16
         type: 'text',
         label: 'Наименование',
         errorMessage: 'Введите корректное имя',
-        valid: false,
+        valid: true,
         touched: false,
         validation: {

[Survived] BooleanLiteral
src/CostList/CostItemAdd/CostItemAdd.tsx:47:18
         label: 'Наименование',
         errorMessage: 'Введите корректное имя',
         valid: false,
-        touched: false,
+        touched: true,
         validation: {
           required: false

[Survived] BooleanLiteral
src/CostList/CostItemAdd/CostItemAdd.tsx:49:21
         valid: false,
         touched: false,
         validation: {
-          required: false
+          required: true
         }
       },

[Survived] ObjectLiteral
src/CostList/CostItemAdd/CostItemAdd.tsx:52:14
           required: false
         }
       },
-      store: {
-        value: '',
-        type: 'text',
-        label: 'Магазин',
-        errorMessage: 'Введите корректый магазин',
-        valid: false,
-        touched: false,
-        validation: {
-          required: false
-        }
-      },
+      store: {},
       cost: {
         value: '',

[Survived] BooleanLiteral
src/CostList/CostItemAdd/CostItemAdd.tsx:57:16
         type: 'text',
         label: 'Магазин',
         errorMessage: 'Введите корректый магазин',
-        valid: false,
+        valid: true,
         touched: false,
         validation: {

[Killed] StringLiteral
src/CostList/CostItemAdd/CostItemAdd.tsx:66:16
       cost: {
         value: '',
         type: 'text',
-        label: 'Цена',
+        label: "",
         errorMessage: 'Введите корректную цену',
         valid: false,
killedBy: CostList Test CostList push add button - form is shown
statusReason: TestingLibraryElementError: Unable to find an element with the text: Цена. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="CostItemList"
    >

[Survived] StringLiteral
src/CostList/CostItemAdd/CostItemAdd.tsx:67:23
         value: '',
         type: 'text',
         label: 'Цена',
-        errorMessage: 'Введите корректную цену',
+        errorMessage: "",
         valid: false,
         touched: false,

[Survived] BooleanLiteral
src/CostList/CostItemAdd/CostItemAdd.tsx:68:16
         type: 'text',
         label: 'Цена',
         errorMessage: 'Введите корректную цену',
-        valid: false,
+        valid: true,
         touched: false,
         validation: {

[Killed] BlockStatement
src/CostList/CostItemAdd/CostItemAdd.tsx:84:31
     categories: [...this.props.categories]
   }
 
-  onCostItemAdd = (): void => {
-    const newCostItem = { ...this.state.costItem }
-    newCostItem.cost = +this.state.formControls.cost.value
-    newCostItem.store = this.state.formControls.store.value
-    newCostItem.name = this.state.formControls.name.value
-    this.props.onAdd(newCostItem)
-  }
+  onCostItemAdd = (): void => {}
 
   renderInputs (): JSX.Element[] {
killedBy: CostItemAdd Test CostItemAdd component press Add
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] UnaryOperator
src/CostList/CostItemAdd/CostItemAdd.tsx:86:24
 
   onCostItemAdd = (): void => {
     const newCostItem = { ...this.state.costItem }
-    newCostItem.cost = +this.state.formControls.cost.value
+    newCostItem.cost = -this.state.formControls.cost.value
     newCostItem.store = this.state.formControls.store.value
     newCostItem.name = this.state.formControls.name.value

[Killed] BlockStatement
src/CostList/CostItemAdd/CostItemAdd.tsx:92:34
     this.props.onAdd(newCostItem)
   }
 
-  renderInputs (): JSX.Element[] {
-    return Object.keys(this.state.formControls)
-      .map((controlName, index) => {
-        const control: IFormParams = (this.state.formControls)[controlName as keyof IAddCostFormInputs]
-        return (
-          <Input key={controlName + index.toString()}
-            type={control.type}
-            value={control.value}
-            label={control.label}
-            shouldValidate={false}
-            valid={control.valid}
-            touched={control.touched}
-            errorMessage={control.errorMessage}
-            onChange={ event => {
-              this.onChangeHandler(event, controlName)
-            } }
-          />
-        )
-      })
-  }
+  renderInputs (): JSX.Element[] {}
 
   onChangeHandler = (event: React.ChangeEvent<HTMLInputElement>, controlName: string): void => {
killedBy: CostList Test CostList push add button - form is shown
statusReason: TestingLibraryElementError: Unable to find an element with the text: Цена. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="CostItemList"
    >

[Killed] BlockStatement
src/CostList/CostItemAdd/CostItemAdd.tsx:94:36
 
   renderInputs (): JSX.Element[] {
     return Object.keys(this.state.formControls)
-      .map((controlName, index) => {
-        const control: IFormParams = (this.state.formControls)[controlName as keyof IAddCostFormInputs]
-        return (
-          <Input key={controlName + index.toString()}
-            type={control.type}
-            value={control.value}
-            label={control.label}
-            shouldValidate={false}
-            valid={control.valid}
-            touched={control.touched}
-            errorMessage={control.errorMessage}
-            onChange={ event => {
-              this.onChangeHandler(event, controlName)
-            } }
-          />
-        )
-      })
+      .map((controlName, index) => {})
   }
 
killedBy: CostList Test CostList push add button - form is shown
statusReason: TestingLibraryElementError: Unable to find an element with the text: Цена. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="CostItemList"
    >

[Survived] ArithmeticOperator
src/CostList/CostItemAdd/CostItemAdd.tsx:97:23
       .map((controlName, index) => {
         const control: IFormParams = (this.state.formControls)[controlName as keyof IAddCostFormInputs]
         return (
-          <Input key={controlName + index.toString()}
+          <Input key={controlName - index.toString()}
             type={control.type}
             value={control.value}

[Survived] BooleanLiteral
src/CostList/CostItemAdd/CostItemAdd.tsx:101:29
             type={control.type}
             value={control.value}
             label={control.label}
-            shouldValidate={false}
+            shouldValidate={true}
             valid={control.valid}
             touched={control.touched}

[NoCoverage] BlockStatement
src/CostList/CostItemAdd/CostItemAdd.tsx:105:33
             valid={control.valid}
             touched={control.touched}
             errorMessage={control.errorMessage}
-            onChange={ event => {
-              this.onChangeHandler(event, controlName)
-            } }
+            onChange={ event => {} }
           />
         )

[NoCoverage] BlockStatement
src/CostList/CostItemAdd/CostItemAdd.tsx:113:96
       })
   }
 
-  onChangeHandler = (event: React.ChangeEvent<HTMLInputElement>, controlName: string): void => {
-    const formControls = { ...this.state.formControls }
-    const control: IFormParams = { ...(this.state.formControls)[controlName as keyof IAddCostFormInputs] }
-
-    control.value = event.target.value;
-
-    (formControls as any)[controlName] = control
-
-    this.setState({
-      formControls
-    })
-  }
+  onChangeHandler = (event: React.ChangeEvent<HTMLInputElement>, controlName: string): void => {}
 
   onSelectHandler = (event: React.ChangeEvent<HTMLSelectElement>): void => {

[NoCoverage] ObjectLiteral
src/CostList/CostItemAdd/CostItemAdd.tsx:114:26
   }
 
   onChangeHandler = (event: React.ChangeEvent<HTMLInputElement>, controlName: string): void => {
-    const formControls = { ...this.state.formControls }
+    const formControls = {}
     const control: IFormParams = { ...(this.state.formControls)[controlName as keyof IAddCostFormInputs] }
 

[NoCoverage] ObjectLiteral
src/CostList/CostItemAdd/CostItemAdd.tsx:115:34
 
   onChangeHandler = (event: React.ChangeEvent<HTMLInputElement>, controlName: string): void => {
     const formControls = { ...this.state.formControls }
-    const control: IFormParams = { ...(this.state.formControls)[controlName as keyof IAddCostFormInputs] }
+    const control: IFormParams = {}
 
     control.value = event.target.value;

[NoCoverage] ObjectLiteral
src/CostList/CostItemAdd/CostItemAdd.tsx:121:19
 
     (formControls as any)[controlName] = control
 
-    this.setState({
-      formControls
-    })
+    this.setState({})
   }
 

[NoCoverage] BlockStatement
src/CostList/CostItemAdd/CostItemAdd.tsx:126:76
     })
   }
 
-  onSelectHandler = (event: React.ChangeEvent<HTMLSelectElement>): void => {
-    const newCostItem = { ...this.state.costItem }
-    newCostItem.category = event.target.value
-    this.setState({
-      costItem: newCostItem
-    })
-  }
+  onSelectHandler = (event: React.ChangeEvent<HTMLSelectElement>): void => {}
 
   render (): JSX.Element | null {

[Killed] BlockStatement
src/CostList/CostItemAdd/CostItemAdd.tsx:134:33
     })
   }
 
-  render (): JSX.Element | null {
-    return (
-      <div>
-        <form>
-          {this.renderInputs()}
-          <Select label='Категория' value={this.state.costItem.category} onChange={this.onSelectHandler} options={this.state.categories}></Select>
-          <Button onClick={this.onCostItemAdd} type='success' disabled={false}>Добавить</Button>
-        </form >
-      </div >
-    )
-  }
+  render (): JSX.Element | null {}
 }
 
killedBy: CostItemAdd Test CostItemAdd component contains
statusReason: TestingLibraryElementError: Unable to find an element with the text: Цена. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/CostList/CostItemAdd/CostItemAdd.tsx:140:73
         <form>
           {this.renderInputs()}
           <Select label='Категория' value={this.state.costItem.category} onChange={this.onSelectHandler} options={this.state.categories}></Select>
-          <Button onClick={this.onCostItemAdd} type='success' disabled={false}>Добавить</Button>
+          <Button onClick={this.onCostItemAdd} type='success' disabled={true}>Добавить</Button>
         </form >
       </div >
killedBy: CostItemAdd Test CostItemAdd component press Add
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
