[Killed] BlockStatement
src/CostList/CostList.tsx:26:33
 }
 
 export class CostList extends Component<ICostItemListProps & DispatchProps, ICostItemListState> {
-  render (): JSX.Element | null {
-    console.log('props123', this.props)
-    return (
-      <div className={classes.CostItemList}>
-        <Button onClick={ this.props.toogleForm } disabled={false} type='primary'>Добавить расход</Button>
-
-        {
-          this.props.showForm &&
-          <CostItemAdd onAdd={ this.props.addCostItem } categories = {this.props.categories}/>
-        }
-
-        {
-          this.props.costItems?.length > 0
-            ? this.props.costItems.map((itemCost, index) =>
-            <CostItem
-              item={itemCost}
-              key={index}
-              onDeleted={this.props.deleteCostItem.bind(this, index)} />)
-            : 'Здесь пока нет элементов покупок'
-        }
-      </div>
-    )
-  }
+  render (): JSX.Element | null {}
 }
 
killedBy: CostList Test CostList component contains
statusReason: TestingLibraryElementError: Unable to find an element with the text: Добавить расход. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] BooleanLiteral
src/CostList/CostList.tsx:30:61
     console.log('props123', this.props)
     return (
       <div className={classes.CostItemList}>
-        <Button onClick={ this.props.toogleForm } disabled={false} type='primary'>Добавить расход</Button>
+        <Button onClick={ this.props.toogleForm } disabled={true} type='primary'>Добавить расход</Button>
 
         {

[Killed] LogicalOperator
src/CostList/CostList.tsx:33:11
         <Button onClick={ this.props.toogleForm } disabled={false} type='primary'>Добавить расход</Button>
 
         {
-          this.props.showForm &&
-          <CostItemAdd onAdd={ this.props.addCostItem } categories = {this.props.categories}/>
+          this.props.showForm || <CostItemAdd onAdd={this.props.addCostItem} categories={this.props.categories} />
         }
 
killedBy: CostList Test CostList component contains
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/CostList/CostList.tsx:33:11
         <Button onClick={ this.props.toogleForm } disabled={false} type='primary'>Добавить расход</Button>
 
         {
-          this.props.showForm &&
-          <CostItemAdd onAdd={ this.props.addCostItem } categories = {this.props.categories}/>
+          false
         }
 
killedBy: CostList Test CostList push add button - form is shown
statusReason: TestingLibraryElementError: Unable to find an element with the text: Цена. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="CostItemList"
    >

[Killed] OptionalChaining
src/CostList/CostList.tsx:38:11
         }
 
         {
-          this.props.costItems?.length > 0
+          this.props.costItems.length > 0
             ? this.props.costItems.map((itemCost, index) =>
             <CostItem
killedBy: CostList Test render CostList component
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/CostList/CostList.tsx:38:11
         }
 
         {
-          this.props.costItems?.length > 0
+          true
             ? this.props.costItems.map((itemCost, index) =>
             <CostItem
killedBy: CostList Test render CostList component
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Survived] ArrowFunction
src/CostList/CostList.tsx:39:40
 
         {
           this.props.costItems?.length > 0
-            ? this.props.costItems.map((itemCost, index) =>
-            <CostItem
-              item={itemCost}
-              key={index}
-              onDeleted={this.props.deleteCostItem.bind(this, index)} />)
+            ? this.props.costItems.map(() => undefined)
             : 'Здесь пока нет элементов покупок'
         }

[NoCoverage] BlockStatement
src/CostList/CostList.tsx:51:71
   }
 }
 
-function mapStateToProps (state: storeValuesType): ICostItemListState {
-  const props = {
-    costItems: state.costItems,
-    showForm: state.uiShow.showAddCostItemForm,
-    categories: state.categories
-  }
-  return props
-}
+function mapStateToProps (state: storeValuesType): ICostItemListState {}
 
 interface DispatchProps {

[NoCoverage] ObjectLiteral
src/CostList/CostList.tsx:52:17
 }
 
 function mapStateToProps (state: storeValuesType): ICostItemListState {
-  const props = {
-    costItems: state.costItems,
-    showForm: state.uiShow.showAddCostItemForm,
-    categories: state.categories
-  }
+  const props = {}
   return props
 }

[NoCoverage] BlockStatement
src/CostList/CostList.tsx:66:65
   toogleForm: typeof toogleAddCostItemFormActionCreator
 }
 
-function mapDispatchToProps (dispatch: Dispatch): DispatchProps {
-  return {
-    addCostItem: (item: CostItemType) => dispatch(addCostItemActionCreator(item)),
-    deleteCostItem: (index: number) => dispatch(deleteCostItemActionCreator(index)),
-    toogleForm: () => dispatch(toogleAddCostItemFormActionCreator())
-  }
-}
+function mapDispatchToProps (dispatch: Dispatch): DispatchProps {}
 
 export default connect(mapStateToProps, mapDispatchToProps)(CostList)

[NoCoverage] ArrowFunction
src/CostList/CostList.tsx:68:18
 
 function mapDispatchToProps (dispatch: Dispatch): DispatchProps {
   return {
-    addCostItem: (item: CostItemType) => dispatch(addCostItemActionCreator(item)),
+    addCostItem: () => undefined,
     deleteCostItem: (index: number) => dispatch(deleteCostItemActionCreator(index)),
     toogleForm: () => dispatch(toogleAddCostItemFormActionCreator())

[NoCoverage] ArrowFunction
src/CostList/CostList.tsx:69:21
 function mapDispatchToProps (dispatch: Dispatch): DispatchProps {
   return {
     addCostItem: (item: CostItemType) => dispatch(addCostItemActionCreator(item)),
-    deleteCostItem: (index: number) => dispatch(deleteCostItemActionCreator(index)),
+    deleteCostItem: () => undefined,
     toogleForm: () => dispatch(toogleAddCostItemFormActionCreator())
   }

[NoCoverage] ArrowFunction
src/CostList/CostList.tsx:70:17
   return {
     addCostItem: (item: CostItemType) => dispatch(addCostItemActionCreator(item)),
     deleteCostItem: (index: number) => dispatch(deleteCostItemActionCreator(index)),
-    toogleForm: () => dispatch(toogleAddCostItemFormActionCreator())
+    toogleForm: () => undefined
   }
 }
