[NoCoverage] BooleanLiteral
src/hoc/Layout/Layout.tsx:17:11
 
 class Layout extends Component<LayoutProps, LayoutState> {
   state = {
-    menu: false
+    menu: true
   }
 

[NoCoverage] BlockStatement
src/hoc/Layout/Layout.tsx:20:35
     menu: false
   }
 
-  toogleMenuHandler = (): void => {
-    this.setState({
-      menu: !this.state.menu
-    })
-  }
+  toogleMenuHandler = (): void => {}
 
   menuCloseHandler = (): void => {

[NoCoverage] ObjectLiteral
src/hoc/Layout/Layout.tsx:21:19
   }
 
   toogleMenuHandler = (): void => {
-    this.setState({
-      menu: !this.state.menu
-    })
+    this.setState({})
   }
 

[NoCoverage] BooleanLiteral
src/hoc/Layout/Layout.tsx:22:13
 
   toogleMenuHandler = (): void => {
     this.setState({
-      menu: !this.state.menu
+      menu: this.state.menu
     })
   }

[NoCoverage] BlockStatement
src/hoc/Layout/Layout.tsx:26:34
     })
   }
 
-  menuCloseHandler = (): void => {
-    this.setState({
-      menu: false
-    })
-  }
+  menuCloseHandler = (): void => {}
 
   render (): JSX.Element {

[NoCoverage] BooleanLiteral
src/hoc/Layout/Layout.tsx:28:13
 
   menuCloseHandler = (): void => {
     this.setState({
-      menu: false
+      menu: true
     })
   }

[NoCoverage] BlockStatement
src/hoc/Layout/Layout.tsx:32:26
     })
   }
 
-  render (): JSX.Element {
-    return (
-        <div className = {classes.Layout}>
-              <Drawer
-                isOpen={
-                    this.state.menu
-                }
-                onClose={this.menuCloseHandler}
-            />
-            <MenuToogle
-                onToogle={this.toogleMenuHandler}
-                isOpen={
-                    this.state.menu
-                }
-            />
-           <main>
-                <Header />
-                { this.props.children }
-            </main>
-        </div>
-    )
-  }
+  render (): JSX.Element {}
 }
 
