[NoCoverage] ObjectLiteral
src/Infrastructure/State/state.tsx:4:3
 import { type CostItemType } from '../../CostList/Types/CostItemType'
 
 export const itemsArray: CostItemType[] = [
-  {
-    name: 'Яблоко',
-    cost: 100,
-    category: 'Фрукты',
-    store: 'Пятёрочка'
-  },
+  {},
   {
     name: 'Ванна',

[NoCoverage] StringLiteral
src/Infrastructure/State/state.tsx:7:15
   {
     name: 'Яблоко',
     cost: 100,
-    category: 'Фрукты',
+    category: "",
     store: 'Пятёрочка'
   },

[NoCoverage] StringLiteral
src/Infrastructure/State/state.tsx:8:12
     name: 'Яблоко',
     cost: 100,
     category: 'Фрукты',
-    store: 'Пятёрочка'
+    store: ""
   },
   {

[NoCoverage] StringLiteral
src/Infrastructure/State/state.tsx:11:11
     store: 'Пятёрочка'
   },
   {
-    name: 'Ванна',
+    name: "",
     cost: 100000,
     category: 'Сантехника',

[NoCoverage] StringLiteral
src/Infrastructure/State/state.tsx:13:15
   {
     name: 'Ванна',
     cost: 100000,
-    category: 'Сантехника',
+    category: "",
     store: 'Водолей'
   },

[NoCoverage] ObjectLiteral
src/Infrastructure/State/state.tsx:16:3
     category: 'Сантехника',
     store: 'Водолей'
   },
-  {
-    name: 'Монитор',
-    cost: 10000,
-    category: 'Техника',
-    store: 'DNS'
-  },
+  {},
   {
     name: 'Гарри поттер и Узник Азкабана',

[NoCoverage] StringLiteral
src/Infrastructure/State/state.tsx:19:15
   {
     name: 'Монитор',
     cost: 10000,
-    category: 'Техника',
+    category: "",
     store: 'DNS'
   },

[NoCoverage] StringLiteral
src/Infrastructure/State/state.tsx:26:12
     name: 'Гарри поттер и Узник Азкабана',
     cost: 1000,
     category: 'Книга',
-    store: 'Книжный мир'
+    store: ""
   }
 ]

[NoCoverage] ArrayDeclaration
src/Infrastructure/State/state.tsx:30:37
   }
 ]
 
-export const categories: string[] = [
-  'Фрукты',
-  'Сантехника',
-  'Техника',
-  'Книга'
-]
+export const categories: string[] = []
 

[NoCoverage] StringLiteral
src/Infrastructure/State/state.tsx:32:3
 
 export const categories: string[] = [
   'Фрукты',
-  'Сантехника',
+  "",
   'Техника',
   'Книга'

[NoCoverage] StringLiteral
src/Infrastructure/State/state.tsx:33:3
 export const categories: string[] = [
   'Фрукты',
   'Сантехника',
-  'Техника',
+  "",
   'Книга'
 ]
