[NoCoverage] ObjectLiteral
src/Navigation/Drawer/Drawer.tsx:8:3
 import cn from 'clsx'
 
 const links = [
-  {
-    to: '/',
-    label: 'Список покупок'
-  },
+  {},
   {
     to: '/categories',

[NoCoverage] StringLiteral
src/Navigation/Drawer/Drawer.tsx:9:9
 
 const links = [
   {
-    to: '/',
+    to: "",
     label: 'Список покупок'
   },

[NoCoverage] ConditionalExpression
src/Navigation/Drawer/Drawer.tsx:23:91
   onClose: () => void
 }
 
-export const getClassName: NavLinkProps['className'] = ({ isActive }) => cn(classes.link, isActive && classes.active)
+export const getClassName: NavLinkProps['className'] = ({ isActive }) => cn(classes.link, true)
 
 class Drawer extends Component<IDrawerProps> {

[NoCoverage] LogicalOperator
src/Navigation/Drawer/Drawer.tsx:23:91
   onClose: () => void
 }
 
-export const getClassName: NavLinkProps['className'] = ({ isActive }) => cn(classes.link, isActive && classes.active)
+export const getClassName: NavLinkProps['className'] = ({ isActive }) => cn(classes.link, isActive || classes.active)
 
 class Drawer extends Component<IDrawerProps> {

[NoCoverage] BlockStatement
src/Navigation/Drawer/Drawer.tsx:26:30
 export const getClassName: NavLinkProps['className'] = ({ isActive }) => cn(classes.link, isActive && classes.active)
 
 class Drawer extends Component<IDrawerProps> {
-  clickHandler = (): void => {
-    this.props.onClose()
-  }
+  clickHandler = (): void => {}
 
   renderLinks (): JSX.Element[] {

[NoCoverage] BlockStatement
src/Navigation/Drawer/Drawer.tsx:30:33
     this.props.onClose()
   }
 
-  renderLinks (): JSX.Element[] {
-    return links.map((link, index) => {
-      return (
-                <li key={index}>
-                   <NavLink
-                   className={getClassName}
-                    to={link.to}
-                    onClick={this.clickHandler}>
-                        {link.label}
-                    </NavLink>
-                </li>
-      )
-    })
-  }
+  renderLinks (): JSX.Element[] {}
 
   render (): JSX.Element {

[NoCoverage] BlockStatement
src/Navigation/Drawer/Drawer.tsx:31:39
   }
 
   renderLinks (): JSX.Element[] {
-    return links.map((link, index) => {
-      return (
-                <li key={index}>
-                   <NavLink
-                   className={getClassName}
-                    to={link.to}
-                    onClick={this.clickHandler}>
-                        {link.label}
-                    </NavLink>
-                </li>
-      )
-    })
+    return links.map((link, index) => {})
   }
 

[NoCoverage] BlockStatement
src/Navigation/Drawer/Drawer.tsx:45:26
     })
   }
 
-  render (): JSX.Element {
-    const cls = [
-      classes.Drawwer
-    ]
-
-    if (!this.props.isOpen) {
-      cls.push(classes.close)
-    }
-
-    return (
-            <>
-            <nav className={cls.join(' ')}>
-                <ul>
-                  {this.renderLinks()}
-                </ul>
-            </nav>
-            {this.props.isOpen
-              ? <Backdrop onClick={this.props.onClose}/>
-              : null}
-            </>
-    )
-  }
+  render (): JSX.Element {}
 }
 

[NoCoverage] BooleanLiteral
src/Navigation/Drawer/Drawer.tsx:50:9
       classes.Drawwer
     ]
 
-    if (!this.props.isOpen) {
+    if (this.props.isOpen) {
       cls.push(classes.close)
     }

[NoCoverage] ConditionalExpression
src/Navigation/Drawer/Drawer.tsx:50:9
       classes.Drawwer
     ]
 
-    if (!this.props.isOpen) {
+    if (true) {
       cls.push(classes.close)
     }
