[NoCoverage] BlockStatement
src/Navigation/MenuToogle/MenuToogle.tsx:9:62
   onToogle: () => void
 }
 
-const MenuToogle = (props: IMenuToogleProps): JSX.Element => {
-  const cls = [
-    classes.MenuToogle,
-    'fa'
-  ]
-
-  if (props.isOpen) {
-    cls.push('fa-times')
-    cls.push(classes.open)
-  } else {
-    cls.push('fa-bars')
-  }
-
-  return (
-        <i
-        className={cls.join(' ')}
-        onClick={props.onToogle}
-        />
-  )
-}
+const MenuToogle = (props: IMenuToogleProps): JSX.Element => {}
 
 export default MenuToogle

[NoCoverage] ArrayDeclaration
src/Navigation/MenuToogle/MenuToogle.tsx:10:15
 }
 
 const MenuToogle = (props: IMenuToogleProps): JSX.Element => {
-  const cls = [
-    classes.MenuToogle,
-    'fa'
-  ]
+  const cls = []
 
   if (props.isOpen) {

[NoCoverage] BlockStatement
src/Navigation/MenuToogle/MenuToogle.tsx:15:21
     'fa'
   ]
 
-  if (props.isOpen) {
-    cls.push('fa-times')
-    cls.push(classes.open)
-  } else {
+  if (props.isOpen) {} else {
     cls.push('fa-bars')
   }

[NoCoverage] ConditionalExpression
src/Navigation/MenuToogle/MenuToogle.tsx:15:7
     'fa'
   ]
 
-  if (props.isOpen) {
+  if (true) {
     cls.push('fa-times')
     cls.push(classes.open)

[NoCoverage] BlockStatement
src/Navigation/MenuToogle/MenuToogle.tsx:18:10
   if (props.isOpen) {
     cls.push('fa-times')
     cls.push(classes.open)
-  } else {
-    cls.push('fa-bars')
-  }
+  } else {}
 
   return (
