[NoCoverage] ArrowFunction
src/Navigation/Navigation/NAvigation.tsx:23:31
     </ProtectedRoute>
 )
 
-export const Navigation: FC = (): JSX.Element => (
-    <HashRouter >
-        <React.StrictMode>
-            <Routes>
-                <Route path="/auth" element={<Auth />} />
-                <Route path="*" element={mainElement} />
-            </Routes>
-        </React.StrictMode>
-    </HashRouter>
-)
+export const Navigation: FC = () => undefined
 
