[NoCoverage] BlockStatement
src/Navigation/NotFound/NotFound.tsx:3:37
 import React from 'react'
 
-const NotFount = (): JSX.Element => {
-  return (
-        <div>Некорректный маршрут</div>
-  )
-}
+const NotFount = (): JSX.Element => {}
 
 export default NotFount
