[NoCoverage] BlockStatement
src/Navigation/ProtectedRoute/ProtectedRoute.tsx:9:74
   children: JSX.Element
 }
 
-export const ProtectedRoute: FC<ProtectedRouteProps> = ({ children }) => {
-  const tokenContext = useTokenContext()
-  const token = tokenContext?.[0]
-  const location = useLocation()
-  if (token !== null && token !== undefined) {
-    return <>{children}</>
-  }
-  return <Navigate to="/auth" state={{ from: location }} replace />
-}
+export const ProtectedRoute: FC<ProtectedRouteProps> = ({ children }) => {}
 

[NoCoverage] OptionalChaining
src/Navigation/ProtectedRoute/ProtectedRoute.tsx:11:17
 
 export const ProtectedRoute: FC<ProtectedRouteProps> = ({ children }) => {
   const tokenContext = useTokenContext()
-  const token = tokenContext?.[0]
+  const token = tokenContext[0]
   const location = useLocation()
   if (token !== null && token !== undefined) {

[NoCoverage] LogicalOperator
src/Navigation/ProtectedRoute/ProtectedRoute.tsx:13:7
   const tokenContext = useTokenContext()
   const token = tokenContext?.[0]
   const location = useLocation()
-  if (token !== null && token !== undefined) {
+  if (token !== null || token !== undefined) {
     return <>{children}</>
   }

[NoCoverage] EqualityOperator
src/Navigation/ProtectedRoute/ProtectedRoute.tsx:13:25
   const tokenContext = useTokenContext()
   const token = tokenContext?.[0]
   const location = useLocation()
-  if (token !== null && token !== undefined) {
+  if (token !== null && token === undefined) {
     return <>{children}</>
   }
