[NoCoverage] BlockStatement
src/redux/actions/storeActions.ts:8:50
   type: string
 }
 
-export function saveStoreActions (): StoreAction {
-  return {
-    type: STORE_SAVE_STORE
-  }
-}
+export function saveStoreActions (): StoreAction {}
 
 export function getStoreActions (): StoreAction {

[NoCoverage] BlockStatement
src/redux/actions/storeActions.ts:14:49
   }
 }
 
-export function getStoreActions (): StoreAction {
-  return {
-    type: STORE_GET_STORE
-  }
-}
+export function getStoreActions (): StoreAction {}
 
 export function saveStoreToLocalStorage () {

[NoCoverage] ObjectLiteral
src/redux/actions/storeActions.ts:15:10
 }
 
 export function getStoreActions (): StoreAction {
-  return {
-    type: STORE_GET_STORE
-  }
+  return {}
 }
 

[NoCoverage] BlockStatement
src/redux/actions/storeActions.ts:20:44
   }
 }
 
-export function saveStoreToLocalStorage () {
-  return async (dispatch: Dispatch<StoreAction>): Promise<void> => {
-    try {
-      dispatch(saveStoreActions())
-    } catch (error) {
-      console.log(error)
-    }
-  }
-}
+export function saveStoreToLocalStorage () {}
 
 export function getStoreToLocalStorage () {

[NoCoverage] BlockStatement
src/redux/actions/storeActions.ts:21:68
 }
 
 export function saveStoreToLocalStorage () {
-  return async (dispatch: Dispatch<StoreAction>): Promise<void> => {
-    try {
-      dispatch(saveStoreActions())
-    } catch (error) {
-      console.log(error)
-    }
-  }
+  return async (dispatch: Dispatch<StoreAction>): Promise<void> => {}
 }
 

[NoCoverage] BlockStatement
src/redux/actions/storeActions.ts:22:9
 
 export function saveStoreToLocalStorage () {
   return async (dispatch: Dispatch<StoreAction>): Promise<void> => {
-    try {
-      dispatch(saveStoreActions())
-    } catch (error) {
+    try {} catch (error) {
       console.log(error)
     }

[NoCoverage] BlockStatement
src/redux/actions/storeActions.ts:24:21
   return async (dispatch: Dispatch<StoreAction>): Promise<void> => {
     try {
       dispatch(saveStoreActions())
-    } catch (error) {
-      console.log(error)
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] BlockStatement
src/redux/actions/storeActions.ts:30:43
   }
 }
 
-export function getStoreToLocalStorage () {
-  return async (dispatch: Dispatch<StoreAction>): Promise<void> => {
-    try {
-      dispatch(getStoreActions())
-    } catch (error) {
-      console.log(error)
-    }
-  }
-}
+export function getStoreToLocalStorage () {}
 

[NoCoverage] BlockStatement
src/redux/actions/storeActions.ts:31:68
 }
 
 export function getStoreToLocalStorage () {
-  return async (dispatch: Dispatch<StoreAction>): Promise<void> => {
-    try {
-      dispatch(getStoreActions())
-    } catch (error) {
-      console.log(error)
-    }
-  }
+  return async (dispatch: Dispatch<StoreAction>): Promise<void> => {}
 }
 

[NoCoverage] BlockStatement
src/redux/actions/storeActions.ts:32:9
 
 export function getStoreToLocalStorage () {
   return async (dispatch: Dispatch<StoreAction>): Promise<void> => {
-    try {
-      dispatch(getStoreActions())
-    } catch (error) {
+    try {} catch (error) {
       console.log(error)
     }

[NoCoverage] BlockStatement
src/redux/actions/storeActions.ts:34:21
   return async (dispatch: Dispatch<StoreAction>): Promise<void> => {
     try {
       dispatch(getStoreActions())
-    } catch (error) {
-      console.log(error)
-    }
+    } catch (error) {}
   }
 }
