[NoCoverage] StringLiteral
src/redux/reducers/storeReducer.ts:5:13
 import { STORE_GET_STORE, STORE_SAVE_STORE } from '../actions/actionTypes'
 import { type StoreAction } from '../actions/storeActions'
 
-const KEY = 'Example_thunk'
+const KEY = ""
 
 const initialState: CostItemType[] = [

[NoCoverage] ObjectLiteral
src/redux/reducers/storeReducer.ts:26:3
     category: 'Техника',
     store: 'DNS'
   },
-  {
-    name: 'Гарри поттер и Узник Азкабана',
-    cost: 1000,
-    category: 'Книга',
-    store: 'Книжный мир'
-  }
+  {}
 ]
 

[NoCoverage] StringLiteral
src/redux/reducers/storeReducer.ts:27:11
     store: 'DNS'
   },
   {
-    name: 'Гарри поттер и Узник Азкабана',
+    name: "",
     cost: 1000,
     category: 'Книга',

[NoCoverage] StringLiteral
src/redux/reducers/storeReducer.ts:29:15
   {
     name: 'Гарри поттер и Узник Азкабана',
     cost: 1000,
-    category: 'Книга',
+    category: "",
     store: 'Книжный мир'
   }

[NoCoverage] ConditionalExpression
src/redux/reducers/storeReducer.ts:36:5
 
 export default function storeReducer (state: CostItemType[] = initialState, action: StoreAction): CostItemType[] {
   switch (action.type) {
-    case STORE_SAVE_STORE: {
-      try {
-        const serializedState = JSON.stringify(state)
-        localStorage.setItem(KEY, serializedState)
-      } catch (e) {
-        console.log(e)
-      }
-      return state
-    }
+    case STORE_SAVE_STORE:
     case STORE_GET_STORE: {
       try {

[NoCoverage] BlockStatement
src/redux/reducers/storeReducer.ts:36:28
 
 export default function storeReducer (state: CostItemType[] = initialState, action: StoreAction): CostItemType[] {
   switch (action.type) {
-    case STORE_SAVE_STORE: {
-      try {
-        const serializedState = JSON.stringify(state)
-        localStorage.setItem(KEY, serializedState)
-      } catch (e) {
-        console.log(e)
-      }
-      return state
-    }
+    case STORE_SAVE_STORE: {}
     case STORE_GET_STORE: {
       try {

[NoCoverage] BlockStatement
src/redux/reducers/storeReducer.ts:37:11
 export default function storeReducer (state: CostItemType[] = initialState, action: StoreAction): CostItemType[] {
   switch (action.type) {
     case STORE_SAVE_STORE: {
-      try {
-        const serializedState = JSON.stringify(state)
-        localStorage.setItem(KEY, serializedState)
-      } catch (e) {
+      try {} catch (e) {
         console.log(e)
       }

[NoCoverage] BlockStatement
src/redux/reducers/storeReducer.ts:40:19
       try {
         const serializedState = JSON.stringify(state)
         localStorage.setItem(KEY, serializedState)
-      } catch (e) {
-        console.log(e)
-      }
+      } catch (e) {}
       return state
     }

[NoCoverage] BlockStatement
src/redux/reducers/storeReducer.ts:45:27
       }
       return state
     }
-    case STORE_GET_STORE: {
-      try {
-        const serializedState: string | null = localStorage.getItem(KEY)
-        if (serializedState == null) {
-          return []
-        }
-        return JSON.parse(serializedState)
-      } catch (e) {
-        console.log(e)
-        return []
-      }
-    }
+    case STORE_GET_STORE: {}
     default:
       return state

[NoCoverage] ConditionalExpression
src/redux/reducers/storeReducer.ts:45:5
       }
       return state
     }
-    case STORE_GET_STORE: {
-      try {
-        const serializedState: string | null = localStorage.getItem(KEY)
-        if (serializedState == null) {
-          return []
-        }
-        return JSON.parse(serializedState)
-      } catch (e) {
-        console.log(e)
-        return []
-      }
-    }
+    case STORE_GET_STORE:
     default:
       return state

[NoCoverage] BlockStatement
src/redux/reducers/storeReducer.ts:46:11
       return state
     }
     case STORE_GET_STORE: {
-      try {
-        const serializedState: string | null = localStorage.getItem(KEY)
-        if (serializedState == null) {
-          return []
-        }
-        return JSON.parse(serializedState)
-      } catch (e) {
+      try {} catch (e) {
         console.log(e)
         return []

[NoCoverage] BlockStatement
src/redux/reducers/storeReducer.ts:48:38
     case STORE_GET_STORE: {
       try {
         const serializedState: string | null = localStorage.getItem(KEY)
-        if (serializedState == null) {
-          return []
-        }
+        if (serializedState == null) {}
         return JSON.parse(serializedState)
       } catch (e) {

[NoCoverage] EqualityOperator
src/redux/reducers/storeReducer.ts:48:13
     case STORE_GET_STORE: {
       try {
         const serializedState: string | null = localStorage.getItem(KEY)
-        if (serializedState == null) {
+        if (serializedState != null) {
           return []
         }

[NoCoverage] ArrayDeclaration
src/redux/reducers/storeReducer.ts:49:18
       try {
         const serializedState: string | null = localStorage.getItem(KEY)
         if (serializedState == null) {
-          return []
+          return ["Stryker was here"]
         }
         return JSON.parse(serializedState)

[NoCoverage] BlockStatement
src/redux/reducers/storeReducer.ts:52:19
           return []
         }
         return JSON.parse(serializedState)
-      } catch (e) {
-        console.log(e)
-        return []
-      }
+      } catch (e) {}
     }
     default:

[NoCoverage] ArrayDeclaration
src/redux/reducers/storeReducer.ts:54:16
         return JSON.parse(serializedState)
       } catch (e) {
         console.log(e)
-        return []
+        return ["Stryker was here"]
       }
     }
