[Survived] ObjectLiteral
src/redux/reducers/uiReducer.ts:8:38
   showAddCostItemForm: boolean
 }
 
-const initialState: uiShowFormType = {
-  showAddCostItemForm: false
-}
+const initialState: uiShowFormType = {}
 
 export default function uiShowReducer (state: uiShowFormType = initialState, action: AnyAction): uiShowFormType {

[Survived] BooleanLiteral
src/redux/reducers/uiReducer.ts:9:24
 }
 
 const initialState: uiShowFormType = {
-  showAddCostItemForm: false
+  showAddCostItemForm: true
 }
 

[Killed] BlockStatement
src/redux/reducers/uiReducer.ts:12:113
   showAddCostItemForm: false
 }
 
-export default function uiShowReducer (state: uiShowFormType = initialState, action: AnyAction): uiShowFormType {
-  switch (action.type) {
-    case COSTITEM_TOOGLE_SHOW_ADD_FORM: {
-      const newState = {
-        ...state,
-        showAddCostItemForm: !state.showAddCostItemForm
-      }
-      return {
-        ...newState
-      }
-    }
-    default:
-      return state
-  }
-}
+export default function uiShowReducer (state: uiShowFormType = initialState, action: AnyAction): uiShowFormType {}
 
killedBy: uiShowReducer Test Send CATEGORIES_ADD return state with change uiShowCostItemForm item
statusReason: TypeError: Cannot read properties of undefined (reading 'showAddCostItemForm')

[Killed] ConditionalExpression
src/redux/reducers/uiReducer.ts:14:5
 
 export default function uiShowReducer (state: uiShowFormType = initialState, action: AnyAction): uiShowFormType {
   switch (action.type) {
-    case COSTITEM_TOOGLE_SHOW_ADD_FORM: {
-      const newState = {
-        ...state,
-        showAddCostItemForm: !state.showAddCostItemForm
-      }
-      return {
-        ...newState
-      }
-    }
+    case COSTITEM_TOOGLE_SHOW_ADD_FORM:
     default:
       return state
killedBy: uiShowReducer Test Send CATEGORIES_ADD return state with change uiShowCostItemForm item
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/redux/reducers/uiReducer.ts:14:41
 
 export default function uiShowReducer (state: uiShowFormType = initialState, action: AnyAction): uiShowFormType {
   switch (action.type) {
-    case COSTITEM_TOOGLE_SHOW_ADD_FORM: {
-      const newState = {
-        ...state,
-        showAddCostItemForm: !state.showAddCostItemForm
-      }
-      return {
-        ...newState
-      }
-    }
+    case COSTITEM_TOOGLE_SHOW_ADD_FORM: {}
     default:
       return state
killedBy: uiShowReducer Test Send CATEGORIES_ADD return state with change uiShowCostItemForm item
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/redux/reducers/uiReducer.ts:17:30
     case COSTITEM_TOOGLE_SHOW_ADD_FORM: {
       const newState = {
         ...state,
-        showAddCostItemForm: !state.showAddCostItemForm
+        showAddCostItemForm: state.showAddCostItemForm
       }
       return {
killedBy: uiShowReducer Test Send CATEGORIES_ADD return state with change uiShowCostItemForm item
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
