[NoCoverage] BlockStatement
src/sagas/index.ts:4:47
 import { takeEvery, select } from '@redux-saga/core/effects'
 import { STORE_SAVE_STORE, STORE_GET_STORE } from '../redux/actions/actionTypes'
 
-export function * getWorkerSaga (): Generator {
-  const storeToGet = select((state) => state)
-  console.log(storeToGet)
-  yield
-}
+export function * getWorkerSaga (): Generator {}
 
 export function * setWorkerSaga (): Generator {

[NoCoverage] ArrowFunction
src/sagas/index.ts:5:29
 import { STORE_SAVE_STORE, STORE_GET_STORE } from '../redux/actions/actionTypes'
 
 export function * getWorkerSaga (): Generator {
-  const storeToGet = select((state) => state)
+  const storeToGet = select(() => undefined)
   console.log(storeToGet)
   yield

[NoCoverage] BlockStatement
src/sagas/index.ts:10:47
   yield
 }
 
-export function * setWorkerSaga (): Generator {
-  const storeToSave = select((state) => state)
-  console.log(storeToSave)
-  yield
-}
+export function * setWorkerSaga (): Generator {}
 
 export function * watchClickSaga (): Generator {

[NoCoverage] ArrowFunction
src/sagas/index.ts:11:30
 }
 
 export function * setWorkerSaga (): Generator {
-  const storeToSave = select((state) => state)
+  const storeToSave = select(() => undefined)
   console.log(storeToSave)
   yield

[NoCoverage] BlockStatement
src/sagas/index.ts:16:48
   yield
 }
 
-export function * watchClickSaga (): Generator {
-  yield takeEvery(STORE_GET_STORE, getWorkerSaga)
-  yield takeEvery(STORE_SAVE_STORE, setWorkerSaga)
-}
+export function * watchClickSaga (): Generator {}
 
 export default function * rootSaga (): Generator {

[NoCoverage] BlockStatement
src/sagas/index.ts:21:50
   yield takeEvery(STORE_SAVE_STORE, setWorkerSaga)
 }
 
-export default function * rootSaga (): Generator {
-  yield watchClickSaga()
-}
+export default function * rootSaga (): Generator {}
 
