[NoCoverage] ArrowFunction
src/UI/Backdrop/Backdrop.tsx:8:18
   onClick: () => void
 }
 
-const Backdrop = (props: IBackdropProps): JSX.Element => <div className={classes.Backdrop}
-onClick={props.onClick}/>
+const Backdrop = () => undefined
 
 export default Backdrop
