[NoCoverage] BlockStatement
src/UI/Button/Button.stories.tsx:9:43
   component: Button
 }
 
-export const Default = (): JSX.Element => {
-  const buttonProps = {
-    onClick: () => {},
-    type: 'success',
-    disabled: false,
-    children: 'button'
-  }
-
-  return <Button
-  onClick={buttonProps.onClick}
-  type={buttonProps.type}
-  disabled={buttonProps.disabled}
-  >
-      {buttonProps.children}
-  </Button>
-}
+export const Default = (): JSX.Element => {}
 
 export const DisabledButton = (): JSX.Element => {

[NoCoverage] BooleanLiteral
src/UI/Button/Button.stories.tsx:13:15
   const buttonProps = {
     onClick: () => {},
     type: 'success',
-    disabled: false,
+    disabled: true,
     children: 'button'
   }

[NoCoverage] StringLiteral
src/UI/Button/Button.stories.tsx:14:15
     onClick: () => {},
     type: 'success',
     disabled: false,
-    children: 'button'
+    children: ""
   }
 

[NoCoverage] BlockStatement
src/UI/Button/Button.stories.tsx:26:50
   </Button>
 }
 
-export const DisabledButton = (): JSX.Element => {
-  const buttonProps = {
-    onClick: () => {},
-    type: 'success',
-    disabled: true,
-    children: 'button'
-  }
-
-  return <Button
-  onClick={buttonProps.onClick}
-  type={buttonProps.type}
-  disabled={buttonProps.disabled}
-  >
-      {buttonProps.children}
-  </Button>
-}
+export const DisabledButton = (): JSX.Element => {}
 
 export const ErrorButton = (): JSX.Element => {

[NoCoverage] StringLiteral
src/UI/Button/Button.stories.tsx:29:11
 export const DisabledButton = (): JSX.Element => {
   const buttonProps = {
     onClick: () => {},
-    type: 'success',
+    type: "",
     disabled: true,
     children: 'button'

[NoCoverage] BooleanLiteral
src/UI/Button/Button.stories.tsx:30:15
   const buttonProps = {
     onClick: () => {},
     type: 'success',
-    disabled: true,
+    disabled: false,
     children: 'button'
   }

[NoCoverage] BlockStatement
src/UI/Button/Button.stories.tsx:43:47
   </Button>
 }
 
-export const ErrorButton = (): JSX.Element => {
-  const buttonProps = {
-    onClick: () => {},
-    type: 'error',
-    disabled: false,
-    children: 'button'
-  }
-
-  return <Button
-    onClick={buttonProps.onClick}
-    type={buttonProps.type}
-    disabled={buttonProps.disabled}
-    >
-        {buttonProps.children}
-    </Button>
-}
+export const ErrorButton = (): JSX.Element => {}
 

[NoCoverage] BooleanLiteral
src/UI/Button/Button.stories.tsx:47:15
   const buttonProps = {
     onClick: () => {},
     type: 'error',
-    disabled: false,
+    disabled: true,
     children: 'button'
   }
