[NoCoverage] BlockStatement
src/UI/Input/Input.stories.tsx:9:43
   component: Input
 }
 
-export const Default = (): JSX.Element => {
-  const inputProps = {
-    label: 'Имя',
-    value: 'test',
-    errorMessage: 'Введите корректый магазин',
-    valid: false,
-    touched: false,
-    validation: {
-      required: false
-    },
-    onChange: (event: React.ChangeEvent<HTMLInputElement>) => {
-    }
-  }
-
-  return <Input
-  type = ""
-  shouldValidate={false}
-  valid={inputProps.valid}
-  touched={inputProps.touched}
-  errorMessage={inputProps.errorMessage}
-  value={inputProps.value}
-  label={inputProps.label}
-  onChange={ inputProps.onChange }/>
-}
+export const Default = (): JSX.Element => {}
 
 export const RadioValues = (): JSX.Element => {

[NoCoverage] StringLiteral
src/UI/Input/Input.stories.tsx:11:12
 
 export const Default = (): JSX.Element => {
   const inputProps = {
-    label: 'Имя',
+    label: "",
     value: 'test',
     errorMessage: 'Введите корректый магазин',

[NoCoverage] BooleanLiteral
src/UI/Input/Input.stories.tsx:25:19
 
   return <Input
   type = ""
-  shouldValidate={false}
+  shouldValidate={true}
   valid={inputProps.valid}
   touched={inputProps.touched}

[NoCoverage] BlockStatement
src/UI/Input/Input.stories.tsx:34:47
   onChange={ inputProps.onChange }/>
 }
 
-export const RadioValues = (): JSX.Element => {
-  const inputProps = {
-    label: 'Имя',
-    value: 'test',
-    errorMessage: 'Введите корректый магазин',
-    valid: false,
-    touched: false,
-    validation: {
-      required: false
-    },
-    onChange: (event: React.ChangeEvent<HTMLInputElement>) => {
-    }
-  }
-
-  return <Input
-  type="radio"
-  shouldValidate={false}
-  valid={inputProps.valid}
-  touched={inputProps.touched}
-  errorMessage={inputProps.errorMessage}
-  value={inputProps.value}
-  label={inputProps.label}
-  onChange={ inputProps.onChange }/>
-}
+export const RadioValues = (): JSX.Element => {}
 

[NoCoverage] ObjectLiteral
src/UI/Input/Input.stories.tsx:35:22
 }
 
 export const RadioValues = (): JSX.Element => {
-  const inputProps = {
-    label: 'Имя',
-    value: 'test',
-    errorMessage: 'Введите корректый магазин',
-    valid: false,
-    touched: false,
-    validation: {
-      required: false
-    },
-    onChange: (event: React.ChangeEvent<HTMLInputElement>) => {
-    }
-  }
+  const inputProps = {}
 
   return <Input

[NoCoverage] BooleanLiteral
src/UI/Input/Input.stories.tsx:50:19
 
   return <Input
   type="radio"
-  shouldValidate={false}
+  shouldValidate={true}
   valid={inputProps.valid}
   touched={inputProps.touched}
