[Survived] LogicalOperator
src/UI/Input/Input.tsx:16:21
 }
 
 const Input = (props: InputProps): JSX.Element => {
-  const inputType = props.type ?? 'text'
+  const inputType = props.type && 'text'
 
   const cls = [

[Survived] StringLiteral
src/UI/Input/Input.tsx:16:35
 }
 
 const Input = (props: InputProps): JSX.Element => {
-  const inputType = props.type ?? 'text'
+  const inputType = props.type ?? ""
 
   const cls = [

[Survived] ArrayDeclaration
src/UI/Input/Input.tsx:18:15
 const Input = (props: InputProps): JSX.Element => {
   const inputType = props.type ?? 'text'
 
-  const cls = [
-    classes.Input
-  ]
+  const cls = []
   const htmlFor = `${inputType}- ${Math.random()}`
 

[Killed] StringLiteral
src/UI/Input/Input.tsx:21:19
   const cls = [
     classes.Input
   ]
-  const htmlFor = `${inputType}- ${Math.random()}`
+  const htmlFor = ``
 
   function isInvalid (props: InputProps): boolean {
killedBy: Auth Test Auth component render enter valid mail- login button is NOT disabled
statusReason: TestingLibraryElementError: Found a label with the text of: Email, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="AuthBlock"
    >

[Survived] BlockStatement
src/UI/Input/Input.tsx:23:51
   ]
   const htmlFor = `${inputType}- ${Math.random()}`
 
-  function isInvalid (props: InputProps): boolean {
-    return !props.valid && props.shouldValidate && props.touched
-  }
+  function isInvalid (props: InputProps): boolean {}
 
   if (isInvalid(props)) {

[Survived] LogicalOperator
src/UI/Input/Input.tsx:24:12
   const htmlFor = `${inputType}- ${Math.random()}`
 
   function isInvalid (props: InputProps): boolean {
-    return !props.valid && props.shouldValidate && props.touched
+    return !props.valid || props.shouldValidate && props.touched
   }
 

[Survived] ConditionalExpression
src/UI/Input/Input.tsx:24:12
   const htmlFor = `${inputType}- ${Math.random()}`
 
   function isInvalid (props: InputProps): boolean {
-    return !props.valid && props.shouldValidate && props.touched
+    return false
   }
 

[Survived] ConditionalExpression
src/UI/Input/Input.tsx:27:7
     return !props.valid && props.shouldValidate && props.touched
   }
 
-  if (isInvalid(props)) {
+  if (false) {
     cls.push(classes.invalid)
   }

[Survived] BlockStatement
src/UI/Input/Input.tsx:27:25
     return !props.valid && props.shouldValidate && props.touched
   }
 
-  if (isInvalid(props)) {
-    cls.push(classes.invalid)
-  }
+  if (isInvalid(props)) {}
 
   return (

[Survived] LogicalOperator
src/UI/Input/Input.tsx:43:20
 
       {
         isInvalid(props)
-          ? <span>{props.errorMessage ?? 'Введите верное значение'}</span>
+          ? <span>{props.errorMessage && 'Введите верное значение'}</span>
           : null
       }
