[Killed] ObjectLiteral
src/Categories/CategoriesContainer.tsx:27:5
     super(props)
 
     this.state =
-    {
-      categoriesWithCosts: this.SetCostsToCategories(this.props.categories, this.props.items)
-    }
+    {}
   }
 
killedBy: CategoriesContainer Test render CostList component
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/Categories/CategoriesContainer.tsx:32:98
     }
   }
 
-  SetCostsToCategories = (categories: string[], items: CostItemType[]): categoriesWithCosts[] => {
-    return categories.map((currentCategory, index) => {
-      const category = currentCategory
-      const costs = items.reduce((accumulator, currentValue) => {
-        if (currentValue.category === category) {
-          accumulator += currentValue.cost
-        }
-        return accumulator
-      }, 0)
-      return {
-        costs,
-        category
-      }
-    })
-  }
+  SetCostsToCategories = (categories: string[], items: CostItemType[]): categoriesWithCosts[] => {}
 
   render (): JSX.Element {
killedBy: CategoriesContainer Test render CostList component
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/Categories/CategoriesContainer.tsx:33:55
   }
 
   SetCostsToCategories = (categories: string[], items: CostItemType[]): categoriesWithCosts[] => {
-    return categories.map((currentCategory, index) => {
-      const category = currentCategory
-      const costs = items.reduce((accumulator, currentValue) => {
-        if (currentValue.category === category) {
-          accumulator += currentValue.cost
-        }
-        return accumulator
-      }, 0)
-      return {
-        costs,
-        category
-      }
-    })
+    return categories.map((currentCategory, index) => {})
   }
 
killedBy: CategoriesContainer Test render CostList component
statusReason: TypeError: Cannot read properties of undefined (reading 'category')

[Killed] BlockStatement
src/Categories/CategoriesContainer.tsx:35:65
   SetCostsToCategories = (categories: string[], items: CostItemType[]): categoriesWithCosts[] => {
     return categories.map((currentCategory, index) => {
       const category = currentCategory
-      const costs = items.reduce((accumulator, currentValue) => {
-        if (currentValue.category === category) {
-          accumulator += currentValue.cost
-        }
-        return accumulator
-      }, 0)
+      const costs = items.reduce((accumulator, currentValue) => {}, 0)
       return {
         costs,
killedBy: CategoriesContainer Test CategoriesContainer component contains
statusReason: TestingLibraryElementError: Unable to find an element with the text: Фрукты : 100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="Categories"
    >

[Killed] ConditionalExpression
src/Categories/CategoriesContainer.tsx:36:13
     return categories.map((currentCategory, index) => {
       const category = currentCategory
       const costs = items.reduce((accumulator, currentValue) => {
-        if (currentValue.category === category) {
+        if (false) {
           accumulator += currentValue.cost
         }
killedBy: CategoriesContainer Test CategoriesContainer component contains
statusReason: TestingLibraryElementError: Unable to find an element with the text: Фрукты : 100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="Categories"
    >

[Killed] BlockStatement
src/Categories/CategoriesContainer.tsx:36:49
     return categories.map((currentCategory, index) => {
       const category = currentCategory
       const costs = items.reduce((accumulator, currentValue) => {
-        if (currentValue.category === category) {
-          accumulator += currentValue.cost
-        }
+        if (currentValue.category === category) {}
         return accumulator
       }, 0)
killedBy: CategoriesContainer Test CategoriesContainer component contains
statusReason: TestingLibraryElementError: Unable to find an element with the text: Фрукты : 100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="Categories"
    >

[Killed] AssignmentOperator
src/Categories/CategoriesContainer.tsx:37:11
       const category = currentCategory
       const costs = items.reduce((accumulator, currentValue) => {
         if (currentValue.category === category) {
-          accumulator += currentValue.cost
+          accumulator -= currentValue.cost
         }
         return accumulator
killedBy: CategoriesContainer Test CategoriesContainer component contains
statusReason: TestingLibraryElementError: Unable to find an element with the text: Фрукты : 100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="Categories"
    >

[Killed] BlockStatement
src/Categories/CategoriesContainer.tsx:48:26
     })
   }
 
-  render (): JSX.Element {
-    return (
-      <div className={classes.Categories}>
-        <div>Категории</div>
-        <ol>
-          {
-            this.state.categoriesWithCosts.map((categoryWithCosts: categoriesWithCosts, index: number) => {
-              const WithBoxStyleHoc = withBoxStyle(CategoriesList)
-              return <WithBoxStyleHoc key = {index} category={ categoryWithCosts.category} costs={categoryWithCosts.costs}/>
-            })
-        }
-        </ol>
-      </div>
-    )
-  }
+  render (): JSX.Element {}
 }
 
killedBy: CategoriesContainer Test CategoriesContainer component contains
statusReason: TestingLibraryElementError: Unable to find an element with the text: Фрукты : 100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/Categories/CategoriesContainer.tsx:54:107
         <div>Категории</div>
         <ol>
           {
-            this.state.categoriesWithCosts.map((categoryWithCosts: categoriesWithCosts, index: number) => {
-              const WithBoxStyleHoc = withBoxStyle(CategoriesList)
-              return <WithBoxStyleHoc key = {index} category={ categoryWithCosts.category} costs={categoryWithCosts.costs}/>
-            })
+            this.state.categoriesWithCosts.map((categoryWithCosts: categoriesWithCosts, index: number) => {})
         }
         </ol>
killedBy: CategoriesContainer Test CategoriesContainer component contains
statusReason: TestingLibraryElementError: Unable to find an element with the text: Фрукты : 100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="Categories"
    >
