[Killed] BlockStatement
src/Categories/CateforiesList/CategoriesList.tsx:8:84
   costs: number
 }
 
-const CategoriesList = ({ category, costs }: ICategoriesListProps): JSX.Element => {
-  return (
-    <li>
-        {category} : {costs}
-    </li>
-
-  )
-}
+const CategoriesList = ({ category, costs }: ICategoriesListProps): JSX.Element => {}
 
 export default CategoriesList
killedBy: CategoriesContainer Test CategoriesContainer component contains
statusReason: TestingLibraryElementError: Unable to find an element with the text: Фрукты : 100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="Categories"
    >
