[Killed] BlockStatement
src/CostList/CostItem/CostItem.tsx:17:30
 }
 
 export class CostItem extends Component<ICostItemLProps, ICostItemState> {
-  onDeleteItem = (): void => {
-    this.props.onDeleted()
-  }
+  onDeleteItem = (): void => {}
 
   render (): JSX.Element | null {
killedBy: CostItem Test CostItem component press Delete button
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/CostList/CostItem/CostItem.tsx:21:33
     this.props.onDeleted()
   }
 
-  render (): JSX.Element | null {
-    const cls = [
-      classes['item-border'],
-      classes.CostItem
-    ]
-
-    return (
-        <div className = {cls.join(' ')}>
-        <div>
-            Название : { this.props.item.name }
-        </div>
-        <div>
-            Стоимость : { this.props.item.cost }
-        </div>
-        <div>
-            Категория : { this.props.item.category }
-        </div>
-        <div>
-            Магазин : { this.props.item.store }
-        </div>
-        <Button onClick={ this.onDeleteItem } type='error' disabled={false}>Удалить</Button>
-    </div>)
-  }
+  render (): JSX.Element | null {}
 }
 
killedBy: CostItem Test CostItem component contains
statusReason: TestingLibraryElementError: Unable to find an element with the text: Стоимость :. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/CostList/CostItem/CostItem.tsx:41:70
         <div>
             Магазин : { this.props.item.store }
         </div>
-        <Button onClick={ this.onDeleteItem } type='error' disabled={false}>Удалить</Button>
+        <Button onClick={ this.onDeleteItem } type='error' disabled={true}>Удалить</Button>
     </div>)
   }
killedBy: CostItem Test CostItem component press Delete button
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
