[Killed] BlockStatement
src/hoc/withBoxStyle/withBoxStyle.tsx:7:6
 export const withBoxStyle = <P extends object>(ComponentToRender: React.ComponentType<P>): {
   (props: P): JSX.Element
   displayName: string
-} => {
-  const WithBoxStyle = (props: P): JSX.Element => {
-    const cls = [
-      classes.Box,
-      classes.Border
-    ]
-    return (<div className={cls.join(' ')}>
-            <ComponentToRender {... props}/>
-        </div>)
-  }
-
-  WithBoxStyle.displayName = 'WithBoxStyle'
-  return WithBoxStyle
-}
+} => {}
 
killedBy: CategoriesContainer Test render CostList component
statusReason: Error: Element type is invalid: expected a string (for built-in components) or a class/function (for composite components) but got: undefined. You likely forgot to export your component from the file it's defined in, or you might have mixed up default and named imports.

Check the render method of `CategoriesContainer`.

[Killed] BlockStatement
src/hoc/withBoxStyle/withBoxStyle.tsx:8:51
   (props: P): JSX.Element
   displayName: string
 } => {
-  const WithBoxStyle = (props: P): JSX.Element => {
-    const cls = [
-      classes.Box,
-      classes.Border
-    ]
-    return (<div className={cls.join(' ')}>
-            <ComponentToRender {... props}/>
-        </div>)
-  }
+  const WithBoxStyle = (props: P): JSX.Element => {}
 
   WithBoxStyle.displayName = 'WithBoxStyle'
killedBy: CategoriesContainer Test CategoriesContainer component contains
statusReason: TestingLibraryElementError: Unable to find an element with the text: Фрукты : 100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="Categories"
    >
