[Killed] BlockStatement
src/Navigation/Header/Header.tsx:6:35
 import { useTokenContext } from '../../Infrastructure/TokenProvider/TokenProvider'
 import Button from '../../UI/Button/Button'
 
-const Header = (): JSX.Element => {
-  const tokenContext = useTokenContext()
-  const logout = tokenContext?.[1].logout as () => void
-  const token = tokenContext?.[0]
-
-  if (token !== undefined && token !== null) {
-    return (<div className={classes.Header}>
-    <Button onClick={(logout)} type="error" disabled={false}>
-      Выйти
-    </Button>
-  </div>)
-  } else {
-    return <>
-    </>
-  }
-}
+const Header = (): JSX.Element => {}
 
 export default Header
killedBy: Header Test Header buttons is in the document if token is exist
statusReason: TestingLibraryElementError: Unable to find an element with the text: Выйти. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] OptionalChaining
src/Navigation/Header/Header.tsx:9:17
 const Header = (): JSX.Element => {
   const tokenContext = useTokenContext()
   const logout = tokenContext?.[1].logout as () => void
-  const token = tokenContext?.[0]
+  const token = tokenContext[0]
 
   if (token !== undefined && token !== null) {
killedBy: Header Test render Header component
statusReason: TypeError: Cannot read properties of null (reading '0')

[Killed] LogicalOperator
src/Navigation/Header/Header.tsx:11:7
   const logout = tokenContext?.[1].logout as () => void
   const token = tokenContext?.[0]
 
-  if (token !== undefined && token !== null) {
+  if (token !== undefined || token !== null) {
     return (<div className={classes.Header}>
     <Button onClick={(logout)} type="error" disabled={false}>
killedBy: Header Test Header buttons is NOT in the document if token is NOT  exist
statusReason: Error: expect(received).toBeNull()

Received: <button class="Button error">Выйти</button>

[Killed] ConditionalExpression
src/Navigation/Header/Header.tsx:11:7
   const logout = tokenContext?.[1].logout as () => void
   const token = tokenContext?.[0]
 
-  if (token !== undefined && token !== null) {
+  if (false) {
     return (<div className={classes.Header}>
     <Button onClick={(logout)} type="error" disabled={false}>
killedBy: Header Test Header buttons is in the document if token is exist
statusReason: TestingLibraryElementError: Unable to find an element with the text: Выйти. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] BooleanLiteral
src/Navigation/Header/Header.tsx:13:55
 
   if (token !== undefined && token !== null) {
     return (<div className={classes.Header}>
-    <Button onClick={(logout)} type="error" disabled={false}>
+    <Button onClick={(logout)} type="error" disabled={true}>
       Выйти
     </Button>

[Survived] BlockStatement
src/Navigation/Header/Header.tsx:17:10
       Выйти
     </Button>
   </div>)
-  } else {
-    return <>
-    </>
-  }
+  } else {}
 }
 
