[Killed] BlockStatement
src/redux/actions/catrgoryActions.ts:12:80
   type: string
   id: number
 }
-export function addCategoryActionCreator (category: string): AddCategoryAction {
-  return {
-    type: CATEGORIES_ADD,
-    category
-  }
-}
+export function addCategoryActionCreator (category: string): AddCategoryAction {}
 
 export function deleteCategoryActionCreator (id: number): DeleteCategoryAction {
killedBy: CategoryAction Test addCategoryActionCreator return valid object
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ObjectLiteral
src/redux/actions/catrgoryActions.ts:13:10
   id: number
 }
 export function addCategoryActionCreator (category: string): AddCategoryAction {
-  return {
-    type: CATEGORIES_ADD,
-    category
-  }
+  return {}
 }
 
killedBy: CategoryAction Test addCategoryActionCreator return valid object
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "CATEGORIES_ADD"
Received: undefined

[Killed] BlockStatement
src/redux/actions/catrgoryActions.ts:19:80
   }
 }
 
-export function deleteCategoryActionCreator (id: number): DeleteCategoryAction {
-  return {
-    type: CATEGORIES_DELETE,
-    id
-  }
-}
+export function deleteCategoryActionCreator (id: number): DeleteCategoryAction {}
 
killedBy: CategoryAction Test deleteCategoryActionCreator return valid object
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ObjectLiteral
src/redux/actions/catrgoryActions.ts:20:10
 }
 
 export function deleteCategoryActionCreator (id: number): DeleteCategoryAction {
-  return {
-    type: CATEGORIES_DELETE,
-    id
-  }
+  return {}
 }
 
killedBy: CategoryAction Test deleteCategoryActionCreator return valid object
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "CATEGORIES_DELETE"
Received: undefined
