[Killed] BlockStatement
src/redux/actions/costItemActions.ts:13:86
   type: string
   id: number
 }
-export function addCostItemActionCreator (costItem: CostItemType): AddCostItemAction {
-  return {
-    type: COSTITEM_ADD,
-    costItem
-  }
-}
+export function addCostItemActionCreator (costItem: CostItemType): AddCostItemAction {}
 
 export function deleteCostItemActionCreator (id: number): DeleteCostItemAction {
killedBy: CostItemAction Test addCostItemActionCreator return valid object
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] BlockStatement
src/redux/actions/costItemActions.ts:20:80
   }
 }
 
-export function deleteCostItemActionCreator (id: number): DeleteCostItemAction {
-  return {
-    type: COSTITEM_DELETE,
-    id
-  }
-}
+export function deleteCostItemActionCreator (id: number): DeleteCostItemAction {}
 
killedBy: CostItemAction Test deleteCostItemActionCreator return valid object
statusReason: TypeError: Cannot read properties of undefined (reading 'type')
