[Killed] BlockStatement
src/redux/actions/uiActions.ts:4:66
 import { type AnyAction } from 'redux'
 import { COSTITEM_TOOGLE_SHOW_ADD_FORM } from './actionTypes'
 
-export function toogleAddCostItemFormActionCreator (): AnyAction {
-  return {
-    type: COSTITEM_TOOGLE_SHOW_ADD_FORM
-  }
-}
+export function toogleAddCostItemFormActionCreator (): AnyAction {}
 
killedBy: UiActions Test toogleAddCostItemForm return valid object
statusReason: TypeError: Cannot read properties of undefined (reading 'type')
