[Survived] ArrayDeclaration
src/redux/reducers/categoryReducer.ts:4:32
 import { type AddCategoryAction, type DeleteCategoryAction } from '../actions/catrgoryActions'
 import { CATEGORIES_ADD, CATEGORIES_DELETE } from '../actions/actionTypes'
 
-const initialState: string[] = [
-  'Фрукты',
-  'Сантехника',
-  'Техника',
-  'Книга'
-]
+const initialState: string[] = []
 
 type categoryAction = AddCategoryAction | DeleteCategoryAction

[Killed] BlockStatement
src/redux/reducers/categoryReducer.ts:13:108
 
 type categoryAction = AddCategoryAction | DeleteCategoryAction
 
-export default function categoryReducer (state: string[] = initialState, action: categoryAction): string[] {
-  switch (action.type) {
-    case CATEGORIES_ADD: {
-      const newState: string[] = state.concat()
-      newState.push((action as AddCategoryAction).category)
-      return newState
-    }
-    case CATEGORIES_DELETE: {
-      const newState: string[] = state.concat()
-      newState.splice((action as DeleteCategoryAction).id, 1)
-      return newState
-    }
-    default:
-      return state
-  }
-}
+export default function categoryReducer (state: string[] = initialState, action: categoryAction): string[] {}
 
killedBy: categoryReducer Test Send CATEGORIES_ADD return state with new Item
statusReason: TypeError: Cannot read properties of undefined (reading 'some')

[Killed] ConditionalExpression
src/redux/reducers/categoryReducer.ts:15:5
 
 export default function categoryReducer (state: string[] = initialState, action: categoryAction): string[] {
   switch (action.type) {
-    case CATEGORIES_ADD: {
-      const newState: string[] = state.concat()
-      newState.push((action as AddCategoryAction).category)
-      return newState
-    }
+    case CATEGORIES_ADD:
     case CATEGORIES_DELETE: {
       const newState: string[] = state.concat()
killedBy: categoryReducer Test Send CATEGORIES_ADD return state with new Item
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/redux/reducers/categoryReducer.ts:15:26
 
 export default function categoryReducer (state: string[] = initialState, action: categoryAction): string[] {
   switch (action.type) {
-    case CATEGORIES_ADD: {
-      const newState: string[] = state.concat()
-      newState.push((action as AddCategoryAction).category)
-      return newState
-    }
+    case CATEGORIES_ADD: {}
     case CATEGORIES_DELETE: {
       const newState: string[] = state.concat()
killedBy: categoryReducer Test Send CATEGORIES_ADD return state with new Item
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/redux/reducers/categoryReducer.ts:20:29
       newState.push((action as AddCategoryAction).category)
       return newState
     }
-    case CATEGORIES_DELETE: {
-      const newState: string[] = state.concat()
-      newState.splice((action as DeleteCategoryAction).id, 1)
-      return newState
-    }
+    case CATEGORIES_DELETE: {}
     default:
       return state
killedBy: categoryReducer Test Send CATEGORIES_DELETED return state without deleted Item
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] ConditionalExpression
src/redux/reducers/categoryReducer.ts:20:5
       newState.push((action as AddCategoryAction).category)
       return newState
     }
-    case CATEGORIES_DELETE: {
-      const newState: string[] = state.concat()
-      newState.splice((action as DeleteCategoryAction).id, 1)
-      return newState
-    }
+    case CATEGORIES_DELETE:
     default:
       return state
killedBy: categoryReducer Test Send CATEGORIES_DELETED return state without deleted Item
statusReason: Error: expect(received).toBeFalsy()

Received: true
