[Killed] BlockStatement
src/redux/reducers/costItemReducer.ts:35:120
 
 type costItemAction = AddCostItemAction | DeleteCostItemAction
 
-export default function costItemReducer (state: CostItemType[] = initialState, action: costItemAction): CostItemType[] {
-  switch (action.type) {
-    case COSTITEM_ADD: {
-      const newState: CostItemType[] = state.concat()
-      newState.push((action as AddCostItemAction).costItem)
-      return newState
-    }
-    case COSTITEM_DELETE: {
-      const newState: CostItemType[] = state.concat()
-      newState.splice((action as DeleteCostItemAction).id, 1)
-      return newState
-    }
-    default:
-      return state
-  }
-}
+export default function costItemReducer (state: CostItemType[] = initialState, action: costItemAction): CostItemType[] {}
 
killedBy: categoryReducer Test Send CATEGORIES_ADD return state with new Item
statusReason: TypeError: Cannot read properties of undefined (reading 'some')

[Killed] ConditionalExpression
src/redux/reducers/costItemReducer.ts:37:5
 
 export default function costItemReducer (state: CostItemType[] = initialState, action: costItemAction): CostItemType[] {
   switch (action.type) {
-    case COSTITEM_ADD: {
-      const newState: CostItemType[] = state.concat()
-      newState.push((action as AddCostItemAction).costItem)
-      return newState
-    }
+    case COSTITEM_ADD:
     case COSTITEM_DELETE: {
       const newState: CostItemType[] = state.concat()
killedBy: categoryReducer Test Send CATEGORIES_ADD return state with new Item
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/redux/reducers/costItemReducer.ts:37:24
 
 export default function costItemReducer (state: CostItemType[] = initialState, action: costItemAction): CostItemType[] {
   switch (action.type) {
-    case COSTITEM_ADD: {
-      const newState: CostItemType[] = state.concat()
-      newState.push((action as AddCostItemAction).costItem)
-      return newState
-    }
+    case COSTITEM_ADD: {}
     case COSTITEM_DELETE: {
       const newState: CostItemType[] = state.concat()
killedBy: categoryReducer Test Send CATEGORIES_ADD return state with new Item
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/redux/reducers/costItemReducer.ts:42:27
       newState.push((action as AddCostItemAction).costItem)
       return newState
     }
-    case COSTITEM_DELETE: {
-      const newState: CostItemType[] = state.concat()
-      newState.splice((action as DeleteCostItemAction).id, 1)
-      return newState
-    }
+    case COSTITEM_DELETE: {}
     default:
       return state
killedBy: categoryReducer Test Send CATEGORIES_DELETED return state without deleted Item
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] ConditionalExpression
src/redux/reducers/costItemReducer.ts:42:5
       newState.push((action as AddCostItemAction).costItem)
       return newState
     }
-    case COSTITEM_DELETE: {
-      const newState: CostItemType[] = state.concat()
-      newState.splice((action as DeleteCostItemAction).id, 1)
-      return newState
-    }
+    case COSTITEM_DELETE:
     default:
       return state
killedBy: categoryReducer Test Send CATEGORIES_DELETED return state without deleted Item
statusReason: Error: expect(received).toBeFalsy()

Received: true
