[Killed] BlockStatement
src/UI/Button/Button.tsx:12:86
 }
 
 // 1. Функциональный компонент, 2. Деструктуризация props
-const Button = ({ type, disabled, children, onClick }: IButtonProps): JSX.Element => {
-  const cls = [
-    classes.Button,
-    classes[type]
-  ]
-
-  return (
-        <button
-            onClick={onClick}
-            className={cls.join(' ')}
-            disabled={disabled}
-        >
-            {
-              // 5. Children types
-            children
-            }
-        </button>
-  )
-}
+const Button = ({ type, disabled, children, onClick }: IButtonProps): JSX.Element => {}
 
 export default Button
killedBy: CostList Test CostList component contains
statusReason: TestingLibraryElementError: Unable to find an element with the text: Добавить расход. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="CostItemList"
    >

[Survived] StringLiteral
src/UI/Button/Button.tsx:21:33
   return (
         <button
             onClick={onClick}
-            className={cls.join(' ')}
+            className={cls.join("")}
             disabled={disabled}
         >
