[Killed] BlockStatement
src/UI/Select/Select.tsx:11:54
   options: string[]
 }
 
-const Select = (props: ISelectProps): JSX.Element => {
-  const htmlFor = `${props.label}-${Math.random()}`
-  return (
-        <div className={classes.Select}>
-            <label htmlFor={htmlFor}>{props.label}</label>
-            <select id={htmlFor}
-            value={props.value}
-            data-testid = 'select'
-            onChange={props.onChange}
-            >
-                {props.options.map((optionItem, index: number) => {
-                  return (
-                        <option
-                        data-testid = 'option'
-                        value={optionItem}
-                        key={optionItem + index.toString()}
-                        >
-                            {optionItem}
-                        </option>
-                  )
-                })}
-            </select>
-        </div>
-  )
-}
+const Select = (props: ISelectProps): JSX.Element => {}
 
 export default Select
killedBy: Select Test Select component contains element with label
statusReason: TestingLibraryElementError: Unable to find an element with the text: Категория. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] StringLiteral
src/UI/Select/Select.tsx:12:19
 }
 
 const Select = (props: ISelectProps): JSX.Element => {
-  const htmlFor = `${props.label}-${Math.random()}`
+  const htmlFor = ``
   return (
         <div className={classes.Select}>

[Killed] BlockStatement
src/UI/Select/Select.tsx:21:67
             data-testid = 'select'
             onChange={props.onChange}
             >
-                {props.options.map((optionItem, index: number) => {
-                  return (
-                        <option
-                        data-testid = 'option'
-                        value={optionItem}
-                        key={optionItem + index.toString()}
-                        >
-                            {optionItem}
-                        </option>
-                  )
-                })}
+                {props.options.map((optionItem, index: number) => {})}
             </select>
         </div>
killedBy: Select Test Select component selected correct option
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="option"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="Select"
    >

[Survived] ArithmeticOperator
src/UI/Select/Select.tsx:26:30
                         <option
                         data-testid = 'option'
                         value={optionItem}
-                        key={optionItem + index.toString()}
+                        key={optionItem - index.toString()}
                         >
                             {optionItem}
