[Survived] StringLiteral
src/redux/actions/actionTypes.ts:4:39
 export const COSTITEM_ADD: string = 'COSTITEM_ADD'
 export const COSTITEM_DELETE: string = 'COSTITEM_DELETE'
 
-export const CATEGORIES_ADD: string = 'CATEGORIES_ADD'
+export const CATEGORIES_ADD: string = ""
 export const CATEGORIES_DELETE: string = 'CATEGORIES_DELETE'
 

[Survived] StringLiteral
src/redux/actions/actionTypes.ts:5:42
 export const COSTITEM_DELETE: string = 'COSTITEM_DELETE'
 
 export const CATEGORIES_ADD: string = 'CATEGORIES_ADD'
-export const CATEGORIES_DELETE: string = 'CATEGORIES_DELETE'
+export const CATEGORIES_DELETE: string = ""
 
 export const STORE_SAVE_STORE: string = 'STORE_SAVE_STORE'
